Examples/SimpleSurface/littleVolcano/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    sea
    {
        type            wall;
        nFaces          1198;
        startFace       409903;
    }
    outside
    {
        type            patch;
        nFaces          4312;
        startFace       411101;
    }
    sky
    {
        type            patch;
        nFaces          3600;
        startFace       415413;
    }
    volcano_wall
    {
        type            wall;
        nFaces          1828;
        startFace       419013;
    }
    volcano_inlet
    {
        type            wall;
        nFaces          68;
        startFace       420841;
    }
    land_region0
    {
        type            wall;
        nFaces          15022;
        startFace       420909;
    }
)

// ************************************************************************* //
